sherlock/hr12b/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ".*" {
        type            calculated;
        value           $internalField;
    }
    inlet
    {
                type            calculated;
        value           $internalField;
    }

    outlet
    {
        // type            fixedValue;
        // value           uniform 0;
        type            calculated;
        value           $internalField;
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            calculated;
        value           $internalField;
    }

    side01
    {
        type            symmetry;
    }

    side02
    {
        type            symmetry;
    }

}

// ************************************************************************* //
